OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1773.h
extern __at(0x029B) volatile __CCP7CONbits_t CCP7CONbits;

#define _CCP7CON_MODE0          0x01
#define _CCP7CON_CCP7MODE0      0x01
#define _CCP7CON_MODE1          0x02
#define _CCP7CON_CCP7MODE1      0x02
#define _CCP7CON_MODE2          0x04
#define _CCP7CON_CCP7MODE2      0x04
#define _CCP7CON_MODE3          0x08
#define _CCP7CON_CCP7MODE3      0x08
#define _CCP7CON_FMT            0x10
#define _CCP7CON_CCP7FMT        0x10
#define _CCP7CON_OUT            0x20
#define _CCP7CON_CCP7OUT        0x20
#define _CCP7CON_EN             0x80
#define _CCP7CON_CCP7EN         0x80

//==============================================================================


//==============================================================================
//        CCP7CAP Bits

extern __at(0x029C) __sfr CCP7CAP;

typedef union
  {
  struct
    {
    unsigned CTS0               : 1;
    unsigned CTS1               : 1;
    unsigned CTS2               : 1;
    unsigned CTS3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP7CTS0           : 1;
    unsigned CCP7CTS1           : 1;
    unsigned CCP7CTS2           : 1;
    unsigned CCP7CTS3           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP7CTS            : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned CTS                : 4;
    unsigned                    : 4;
    };
  } __CCP7CAPbits_t;

extern __at(0x029C) volatile __CCP7CAPbits_t CCP7CAPbits;

#define _CCP7CAP_CTS0           0x01
#define _CCP7CAP_CCP7CTS0       0x01
#define _CCP7CAP_CTS1           0x02
#define _CCP7CAP_CCP7CTS1       0x02
#define _CCP7CAP_CTS2           0x04
#define _CCP7CAP_CCP7CTS2       0x04
#define _CCP7CAP_CTS3           0x08
#define _CCP7CAP_CCP7CTS3       0x08

//==============================================================================


//==============================================================================
//        CCPTMRS1 Bits

extern __at(0x029E) __sfr CCPTMRS1;

typedef union
  {
  struct
    {
    unsigned C1TSEL0            : 1;
    unsigned C1TSEL1            : 1;
    unsigned C2TSEL0            : 1;
    unsigned C2TSEL1            : 1;
    unsigned C7TSEL0            : 1;
    unsigned C7TSEL1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C1TSEL             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned C2TSEL             : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned C7TSEL             : 2;
    unsigned                    : 2;
    };
  } __CCPTMRS1bits_t;

extern __at(0x029E) volatile __CCPTMRS1bits_t CCPTMRS1bits;

#define _C1TSEL0                0x01
#define _C1TSEL1                0x02
#define _C2TSEL0                0x04
#define _C2TSEL1                0x08
#define _C7TSEL0                0x10
#define _C7TSEL1                0x20

//==============================================================================


//==============================================================================
//        CCPTMRS2 Bits

extern __at(0x029F) __sfr CCPTMRS2;

typedef union
  {
  struct
    {
    unsigned P3TSEL0            : 1;
    unsigned P3TSEL1            : 1;
    unsigned P4TSEL0            : 1;
    unsigned P4TSEL1            : 1;
    unsigned P9TSEL0            : 1;
    unsigned P9TSEL1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P3TSEL             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned P4TSEL             : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P9TSEL             : 2;
    unsigned                    : 2;
    };
  } __CCPTMRS2bits_t;

extern __at(0x029F) volatile __CCPTMRS2bits_t CCPTMRS2bits;

#define _P3TSEL0                0x01
#define _P3TSEL1                0x02
#define _P4TSEL0                0x04
#define _P4TSEL1                0x08
#define _P9TSEL0                0x10
#define _P9TSEL1                0x20

//==============================================================================


//==============================================================================
//        SLRCONA Bits

extern __at(0x030C) __sfr SLRCONA;

typedef struct
  {
  unsigned SLRA0                : 1;
  unsigned SLRA1                : 1;
  unsigned SLRA2                : 1;
  unsigned SLRA3                : 1;
  unsigned SLRA4                : 1;
  unsigned SLRA5                : 1;
  unsigned SLRA6                : 1;
  unsigned SLRA7                : 1;
  } __SLRCONAbits_t;

extern __at(0x030C) volatile __SLRCONAbits_t SLRCONAbits;

#define _SLRA0                  0x01
#define _SLRA1                  0x02
#define _SLRA2                  0x04
#define _SLRA3                  0x08
#define _SLRA4                  0x10
#define _SLRA5                  0x20
#define _SLRA6                  0x40
#define _SLRA7                  0x80

//==============================================================================


//==============================================================================
//        SLRCONB Bits

extern __at(0x030D) __sfr SLRCONB;

typedef struct
  {
  unsigned SLRB0                : 1;
  unsigned SLRB1                : 1;
  unsigned SLRB2                : 1;
  unsigned SLRB3                : 1;
  unsigned SLRB4                : 1;
  unsigned SLRB5                : 1;
  unsigned SLRB6                : 1;
  unsigned SLRB7                : 1;
  } __SLRCONBbits_t;

extern __at(0x030D) volatile __SLRCONBbits_t SLRCONBbits;

