OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1773.h
extern __at(0x079B) __sfr PRG3FTSS;

typedef union
  {
  struct
    {
    unsigned FTSS0              : 1;
    unsigned FTSS1              : 1;
    unsigned FTSS2              : 1;
    unsigned FTSS3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG3FTSS0           : 1;
    unsigned RG3FTSS1           : 1;
    unsigned RG3FTSS2           : 1;
    unsigned RG3FTSS3           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG3FTSS            : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned FTSS               : 4;
    unsigned                    : 4;
    };
  } __PRG3FTSSbits_t;

extern __at(0x079B) volatile __PRG3FTSSbits_t PRG3FTSSbits;

#define _PRG3FTSS_FTSS0         0x01
#define _PRG3FTSS_RG3FTSS0      0x01
#define _PRG3FTSS_FTSS1         0x02
#define _PRG3FTSS_RG3FTSS1      0x02
#define _PRG3FTSS_FTSS2         0x04
#define _PRG3FTSS_RG3FTSS2      0x04
#define _PRG3FTSS_FTSS3         0x08
#define _PRG3FTSS_RG3FTSS3      0x08

//==============================================================================


//==============================================================================
//        PRG3INS Bits

extern __at(0x079C) __sfr PRG3INS;

typedef union
  {
  struct
    {
    unsigned INS0               : 1;
    unsigned INS1               : 1;
    unsigned INS2               : 1;
    unsigned INS3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG3INS0            : 1;
    unsigned RG3INS1            : 1;
    unsigned RG3INS2            : 1;
    unsigned RG3INS3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned INS                : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned RG3INS             : 4;
    unsigned                    : 4;
    };
  } __PRG3INSbits_t;

extern __at(0x079C) volatile __PRG3INSbits_t PRG3INSbits;

#define _PRG3INS_INS0           0x01
#define _PRG3INS_RG3INS0        0x01
#define _PRG3INS_INS1           0x02
#define _PRG3INS_RG3INS1        0x02
#define _PRG3INS_INS2           0x04
#define _PRG3INS_RG3INS2        0x04
#define _PRG3INS_INS3           0x08
#define _PRG3INS_RG3INS3        0x08

//==============================================================================


//==============================================================================
//        PRG3CON0 Bits

extern __at(0x079D) __sfr PRG3CON0;

typedef union
  {
  struct
    {
    unsigned GO                 : 1;
    unsigned OS                 : 1;
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned REDG               : 1;
    unsigned FEDG               : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned RG3GO              : 1;
    unsigned RG3OS              : 1;
    unsigned RG3MODE0           : 1;
    unsigned RG3MODE1           : 1;
    unsigned RG3REDG            : 1;
    unsigned RG3FEDG            : 1;
    unsigned                    : 1;
    unsigned RG3EN              : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned RG3MODE            : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned MODE               : 2;
    unsigned                    : 4;
    };
  } __PRG3CON0bits_t;

extern __at(0x079D) volatile __PRG3CON0bits_t PRG3CON0bits;

#define _PRG3CON0_GO            0x01
#define _PRG3CON0_RG3GO         0x01
#define _PRG3CON0_OS            0x02
#define _PRG3CON0_RG3OS         0x02
#define _PRG3CON0_MODE0         0x04
#define _PRG3CON0_RG3MODE0      0x04
#define _PRG3CON0_MODE1         0x08
#define _PRG3CON0_RG3MODE1      0x08
#define _PRG3CON0_REDG          0x10
#define _PRG3CON0_RG3REDG       0x10
#define _PRG3CON0_FEDG          0x20
#define _PRG3CON0_RG3FEDG       0x20
#define _PRG3CON0_EN            0x80
#define _PRG3CON0_RG3EN         0x80

//==============================================================================


//==============================================================================
//        PRG3CON1 Bits

extern __at(0x079E) __sfr PRG3CON1;

typedef union
  {
  struct
    {
    unsigned RPOL               : 1;
    unsigned FPOL               : 1;
    unsigned RDY                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG3RPOL            : 1;
    unsigned RG3FPOL            : 1;
    unsigned RG3RDY             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PRG3CON1bits_t;

extern __at(0x079E) volatile __PRG3CON1bits_t PRG3CON1bits;

#define _PRG3CON1_RPOL          0x01
#define _PRG3CON1_RG3RPOL       0x01
#define _PRG3CON1_FPOL          0x02
#define _PRG3CON1_RG3FPOL       0x02
#define _PRG3CON1_RDY           0x04
#define _PRG3CON1_RG3RDY        0x04

//==============================================================================


//==============================================================================
//        PRG3CON2 Bits

extern __at(0x079F) __sfr PRG3CON2;

typedef union
  {
  struct
    {
    unsigned ISET0              : 1;
    unsigned ISET1              : 1;
    unsigned ISET2              : 1;
    unsigned ISET3              : 1;
    unsigned ISET4              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG3ISET0           : 1;
    unsigned RG3ISET1           : 1;
    unsigned RG3ISET2           : 1;
    unsigned RG3ISET3           : 1;
    unsigned RG3ISET4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ISET               : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned RG3ISET            : 5;
    unsigned                    : 3;
    };
  } __PRG3CON2bits_t;

extern __at(0x079F) volatile __PRG3CON2bits_t PRG3CON2bits;

#define _PRG3CON2_ISET0         0x01
#define _PRG3CON2_RG3ISET0      0x01
#define _PRG3CON2_ISET1         0x02
#define _PRG3CON2_RG3ISET1      0x02
#define _PRG3CON2_ISET2         0x04
#define _PRG3CON2_RG3ISET2      0x04
#define _PRG3CON2_ISET3         0x08
#define _PRG3CON2_RG3ISET3      0x08
#define _PRG3CON2_ISET4         0x10
#define _PRG3CON2_RG3ISET4      0x10

//==============================================================================


//==============================================================================
//        COG3PHR Bits

