OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1773.h
extern __at(0x0DBF) __sfr PWM11LDCON;

typedef union
  {
  struct
    {
    unsigned PWM11LDS0          : 1;
    unsigned PWM11LDS1          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned LDT                : 1;
    unsigned LDA                : 1;
    };

  struct
    {
    unsigned LDS0               : 1;
    unsigned LDS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM11LDM           : 1;
    unsigned PWM11LD            : 1;
    };

  struct
    {
    unsigned PWM11LDS           : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned LDS                : 2;
    unsigned                    : 6;
    };
  } __PWM11LDCONbits_t;

extern __at(0x0DBF) volatile __PWM11LDCONbits_t PWM11LDCONbits;

#define _PWM11LDCON_PWM11LDS0   0x01
#define _PWM11LDCON_LDS0        0x01
#define _PWM11LDCON_PWM11LDS1   0x02
#define _PWM11LDCON_LDS1        0x02
#define _PWM11LDCON_LDT         0x40
#define _PWM11LDCON_PWM11LDM    0x40
#define _PWM11LDCON_LDA         0x80
#define _PWM11LDCON_PWM11LD     0x80

//==============================================================================


//==============================================================================
//        PWM11OFCON Bits

extern __at(0x0DC0) __sfr PWM11OFCON;

typedef union
  {
  struct
    {
    unsigned PWM11OFS0          : 1;
    unsigned PWM11OFS1          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OFO                : 1;
    unsigned PWM11OFM0          : 1;
    unsigned PWM11OFM1          : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OFS0               : 1;
    unsigned OFS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM11OFMC          : 1;
    unsigned OFM0               : 1;
    unsigned OFM1               : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OFS                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned PWM11OFS           : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 5;
    unsigned PWM11OFM           : 2;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 5;
    unsigned OFM                : 2;
    unsigned                    : 1;
    };
  } __PWM11OFCONbits_t;

extern __at(0x0DC0) volatile __PWM11OFCONbits_t PWM11OFCONbits;

#define _PWM11OFCON_PWM11OFS0   0x01
#define _PWM11OFCON_OFS0        0x01
#define _PWM11OFCON_PWM11OFS1   0x02
#define _PWM11OFCON_OFS1        0x02
#define _PWM11OFCON_OFO         0x10
#define _PWM11OFCON_PWM11OFMC   0x10
#define _PWM11OFCON_PWM11OFM0   0x20
#define _PWM11OFCON_OFM0        0x20
#define _PWM11OFCON_PWM11OFM1   0x40
#define _PWM11OFCON_OFM1        0x40

//==============================================================================


//==============================================================================
//        PPSLOCK Bits

extern __at(0x0E0C) __sfr PPSLOCK;

typedef struct
  {
  unsigned PPSLOCKED            : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PPSLOCKbits_t;

extern __at(0x0E0C) volatile __PPSLOCKbits_t PPSLOCKbits;

#define _PPSLOCKED              0x01

//==============================================================================

extern __at(0x0E0D) __sfr INTPPS;
extern __at(0x0E0E) __sfr T0CKIPPS;
extern __at(0x0E0F) __sfr T1CKIPPS;
extern __at(0x0E10) __sfr T1GPPS;
extern __at(0x0E11) __sfr T3CKIPPS;
extern __at(0x0E12) __sfr T3GPPS;
extern __at(0x0E13) __sfr T5CKIPPS;
extern __at(0x0E14) __sfr T5GPPS;
extern __at(0x0E15) __sfr T2CKIPPS;
extern __at(0x0E16) __sfr T4CKIPPS;
extern __at(0x0E17) __sfr T6CKIPPS;
extern __at(0x0E18) __sfr T8CKIPPS;
extern __at(0x0E19) __sfr CCP1PPS;
extern __at(0x0E1A) __sfr CCP2PPS;
extern __at(0x0E1B) __sfr CCP7PPS;
extern __at(0x0E1D) __sfr COG1INPPS;
extern __at(0x0E1E) __sfr COG2INPPS;
extern __at(0x0E1F) __sfr COG3INPPS;
extern __at(0x0E21) __sfr MD1CLPPS;
extern __at(0x0E22) __sfr MD1CHPPS;
extern __at(0x0E23) __sfr MD1MODPPS;
extern __at(0x0E24) __sfr MD2CLPPS;
extern __at(0x0E25) __sfr MD2CHPPS;
extern __at(0x0E26) __sfr MD2MODPPS;
extern __at(0x0E27) __sfr MD3CLPPS;
extern __at(0x0E28) __sfr MD3CHPPS;
extern __at(0x0E29) __sfr MD3MODPPS;
extern __at(0x0E2D) __sfr PRG1RPPS;
extern __at(0x0E2E) __sfr PRG1FPPS;
extern __at(0x0E2F) __sfr PRG2RPPS;
extern __at(0x0E30) __sfr PRG2FPPS;
extern __at(0x0E31) __sfr PRG3RPPS;
extern __at(0x0E32) __sfr PRG3FPPS;
extern __at(0x0E35) __sfr CLCIN0PPS;
extern __at(0x0E36) __sfr CLCIN1PPS;
extern __at(0x0E37) __sfr CLCIN2PPS;
extern __at(0x0E38) __sfr CLCIN3PPS;
extern __at(0x0E39) __sfr ADCACTPPS;
extern __at(0x0E3A) __sfr SSPCLKPPS;
extern __at(0x0E3B) __sfr SSPDATPPS;
extern __at(0x0E3C) __sfr SSPSSPPS;
extern __at(0x0E3D) __sfr RXPPS;
extern __at(0x0E3E) __sfr CKPPS;
extern __at(0x0E90) __sfr RA0PPS;
extern __at(0x0E91) __sfr RA1PPS;
extern __at(0x0E92) __sfr RA2PPS;
extern __at(0x0E93) __sfr RA3PPS;
extern __at(0x0E94) __sfr RA4PPS;
extern __at(0x0E95) __sfr RA5PPS;
extern __at(0x0E96) __sfr RA6PPS;
extern __at(0x0E97) __sfr RA7PPS;
extern __at(0x0E98) __sfr RB0PPS;
extern __at(0x0E99) __sfr RB1PPS;
extern __at(0x0E9A) __sfr RB2PPS;
extern __at(0x0E9B) __sfr RB3PPS;
extern __at(0x0E9C) __sfr RB4PPS;
extern __at(0x0E9D) __sfr RB5PPS;
extern __at(0x0E9E) __sfr RB6PPS;
extern __at(0x0E9F) __sfr RB7PPS;
extern __at(0x0EA0) __sfr RC0PPS;
extern __at(0x0EA1) __sfr RC1PPS;
extern __at(0x0EA2) __sfr RC2PPS;
extern __at(0x0EA3) __sfr RC3PPS;
extern __at(0x0EA4) __sfr RC4PPS;
extern __at(0x0EA5) __sfr RC5PPS;
extern __at(0x0EA6) __sfr RC6PPS;
extern __at(0x0EA7) __sfr RC7PPS;

//==============================================================================
//        CLCDATA Bits

extern __at(0x0F0F) __sfr CLCDATA;

typedef struct
  {
  unsigned MCLC1OUT             : 1;
  unsigned MCLC2OUT             : 1;
  unsigned MCLC3OUT             : 1;
  unsigned MLC4OUT              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __CLCDATAbits_t;

extern __at(0x0F0F) volatile __CLCDATAbits_t CLCDATAbits;

#define _MCLC1OUT               0x01
#define _MCLC2OUT               0x02
#define _MCLC3OUT               0x04
#define _MLC4OUT                0x08

//==============================================================================


//==============================================================================
//        CLC1CON Bits

extern __at(0x0F10) __sfr CLC1CON;

typedef union
  {
  struct
    {
    unsigned LC1MODE0           : 1;
    unsigned LC1MODE1           : 1;
    unsigned LC1MODE2           : 1;
    unsigned LC1INTN            : 1;
    unsigned LC1INTP            : 1;
    unsigned LC1OUT             : 1;
    unsigned                    : 1;
    unsigned LC1EN              : 1;
    };

  struct
    {
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned MODE2              : 1;
    unsigned INTN               : 1;
    unsigned INTP               : 1;
    unsigned OUT                : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned LC1MODE            : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned MODE               : 3;
    unsigned                    : 5;
    };
  } __CLC1CONbits_t;

